<?php if (!defined('BASEPATH')) exit('No direct script access allowed');
/**
 * MLS
 *
 * MLS系统类库
 *
 * @package         MLS
 * @author          EllisLab Dev Team
 * @copyright       Copyright (c) 2006 - 2014
 * @link            http://mls.house.com
 * @since           Version 1.0
 */
// ------------------------------------------------------------------------


/**
 * Contract_config_model CLASS *
 *
 *
 * @package         MLS
 * @subpackage      Models
 * @category        Models
 * @author          Lion
 */
class Bargain_config_model extends MY_Model
{

    public function get_config()
    {
        $config = array(
//            'bargain_type' => array(
//                1 => '过户及贷款',
//                2 => '违约金',
//                3 => '办件费',
//                4 => '评估费',
//                5 => '区域合作',
//                6 => '装修推荐',
//                7 => '加盟费',
//                8 => '未收款余额',
//                9 => '垫资费',
//                10 => '其它'
//            ),
            'bargain_type' => array(
                1 => '二手买卖',
                2 => '一手买卖',
                3 => '租赁',
                4 => '代办证',
            ),
            'agent_type' => array(
                1 => '预告登记',
                2 => '期房转现房',
                3 => '现房',
            ),
//            'is_mortgage' => array(
//                1 => '有抵押',
//                2 => '无抵押',
//            ),
            'keyword_type' => array(
                1 => '成交编号',
                2 => '房源编号',
                3 => '物业地址',
                4 => '楼盘名称',
                5 => '客户姓名',
                6 => '签约人',
                7 => '房客来源',
//                8 => '结佣方',
                9 => '托管编号'
            ),
            'notice_keyword_type' => array(
                1 => '标题',
                2 => '文号',
                3 => '发布人',
            ),
            'document_keyword_type' => array(
                1 => '文件名',
                2 => '上传人',
            ),
            'is_check' => array(
                1 => '未审',
                2 => '初审',
                3 => '复审',
                4 => '异常',
            ),
            'buy_type' => array(
                1 => '一次性付款',
                2 => '分期付款',
                3 => '按揭'
            ),
            'land_nature' => array(
                1 => '出让',
                2 => '划拨',
            ),
            'signatory_company' => array(
                1 => '杭州科地',
            ),
            'date_type' => array(
                1 => '成交日',
                2 => '结佣日',
                3 => '结盘日',
                4 => '风控日',
                5 => '权证日',
                6 => '创建日'
            ),
            'collect_status' => array(
                1 => '有效全部',
                2 => '未结佣',
                3 => '已结佣',
                4 => '未结盘',
                5 => '已结盘',
                6 => '撤单',
            ),
            'bargain_status' => array(
                1 => '办理中',
                2 => '结案',
                3 => '作废'
            ),
            'district_id' => array(
                1 => '上城区',
                2 => '下城区',
                3 => '江干区',
                4 => '拱墅区',
                5 => '西湖区',
                6 => '滨江高新技术开发区',
                7 => '下沙经济技术开发区',
                8 => '之江旅游度假区',
                9 => '余杭区',
                10 => '萧山区',
            ),
            'finance_id' => array(
                1 => '王群英',
                2 => '李萍',
                3 => '傅泽林',
                4 => '夏炎',
                5 => '魏丽',
                6 => '王煜梁',
                7 => '李丹',
                8 => '洪孝俊',
                9 => '王志玲',
                10 => '舒信晨',
                11 => '李平',
            ),
            'house_type' => array(
                1 => '普通住宅（140㎡以下含）',
                2 => '非普通住宅（140㎡以上）',
                3 => '非住宅'
            ),

            'loan_type' => array(
                1 => '商业',
                2 => '纯市公积金（铁）',
                3 => '纯省公积金',
                4 => '市公积金组合（铁）',
                5 => '省公积金组合',
            ),
            'tax_pay_type' => array(
                1 => '买方承担',
                2 => '卖方承担',
                3 => '各自承担',
                4 => '按约定承担'
            ),
            'note_belong' => array(
                1 => '归买方所有',
                2 => '归卖方所有',
                3 => '各自所有',
            ),
            'stage_type' => array(
                1 => '签约',
                2 => '代收付款',
                3 => '贷款',
                4 => '过户',
            ),

            'replace_type' => array(
                1 => '代收',
                2 => '代付',
                3 => '转其它收入',
                4 => '转佣金收款',
                5 => '转账',
                6 => '实收'
            ),
            'should_collect_type' => array(
                1 => '应收',
                2 => '实收',
            ),
            'target_type' => array(
                1 => '买方',
                2 => '卖方',
            ),
            'notice_type' => array(
                1 => '总部规章制度',
                2 => '总部媒体宣传',
                3 => '总部广告投放',
                4 => '总部各类公告',
                5 => '一手成交喜报',
                6 => '一手房源销控',
                7 => '一手项目资料',
                8 => '一手销售资料',
                9 => '二手成交喜报',
                10 => '交易及银行新政',
                11 => '签约中心流程',
                12 => '签约中心各类广告',
                13 => '楼盘字典整改',
                14 => '加盟店并盘公告',
                15 => '公盘业务公告',
                16 => '公盘管理公告',
                17 => '财务公告',
                18 => '招聘公告',
                19 => '培训公告',
            ),
            'color' => array(
                '#f00' => '红色',
                '#f90' => '橙色',
            ),
            'business_type' => array(
                1 => '房源',
                2 => '客源',
                3 => '钥匙',
                4 => '独家',
                5 => '签成交',
                6 => '转介绍',
                7 => '收房',
                8 => '勘察',
                9 => '代办贷款',
                10 => '其它'
            ),
            'money_type' => array(
                1 => '签约费',
                2 => '评估费',
                3 => '中介费',
                4 => '税费',
                5 => '房款',
                6 => '其它',
                7 => '解约费',
            ),
            'collect_type' => array(
                1 => '客户',
                2 => '业主',
                3 => '银行',
                4 => '政府',
                5 => '内部',
                6 => '其它'
            ),
            'pay_type' => array(
                1 => '现金',
                2 => '转账',
                3 => '支票',
                4 => 'POS',
                5 => '易极付',
                8 => '其它'
            ),
            'price_type' => array(
                1 => '元/月',
                2 => '元/年',
                3 => '元/平米*月',
                4 => '元/平米*天'
            ),

            'payment_method' => array(
                1 => '现金',
                2 => '支票',
                3 => '转账',
                4 => '汇款',
            ),

            'buy_type_r' => array(
                1 => '月付',
                2 => '季付',
                3 => '半年付',
                4 => '年付'
            ),
            'buy_type_s' => array(
                1 => '全款',
                2 => '商贷',
                3 => '公积金',
                4 => '公积金+商贷'
            ),
            'divide_type' => array(
                1 => '房源',
                2 => '客源',
                3 => '钥匙',
                4 => '独家',
                5 => '签成交',
                6 => '转介绍',
                7 => '收房',
                8 => '勘察',
                9 => '代办贷款',
                10 => '其它'
            ),
            'type' => array(
                1 => '出售',
                2 => '出租'
            ),
            'is_evaluate' => array(
                1 => '是',
                2 => '否',
                3 => '自评'
            ),
            'status2' => array(
                1 => '待审核',
                3 => '未通过',
                5 => '履行中',
                6 => '已办结',
                4 => '终止'
            ),
            'cont_status' => array(
                1 => '待审核',
                2 => '生效',
                3 => '审核不通过',
                4 => '终止',
                5 => '已结佣',
                6 => '已结盘'
            ),
            'cont_status_r' => array(
                1 => '待审核',
                2 => '生效',
                3 => '审核不通过',
                4 => '终止',
                5 => '已结佣'
            ),
            'flow_status' => array(
                0 => '待审核',
                1 => '审核通过',
                2 => '审核未通过'
            ),

            'datetype_r' => array(
                1 => '签约时间',
                2 => '结佣日期'
            ),
            'datetype1' => array(
                2 => '收付日期',
                1 => '签约时间'

            ),
            'docket_type' => array(
                1 => '佣金单据',
                2 => '房款收据',
                3 => '税费收据'
            ),
            'report_status' => array(
                1 => '未转正',
                2 => '已转正'
            ),
            'is_cooperate' => array(
                0 => '否',
                1 => '是'
            ),
            'seller_lacks' => array(
                1 => '房屋所有权证、共有权证',
                2 => '契证',
                3 => '土地使用权证',
                4 => '不动产权证书',
                5 => '不动产发票（原件）',
                6 => '契税发票（原件）',
                7 => '身份证',
                8 => '婚姻资料',
                9 => '户口本',
                10 => '委托公证书',
            ),
            'buyer_lacks' => array(
                1 => '身份证',
                2 => '婚姻资料',
                3 => '户口本',
                4 => '交契税查档',
                5 => '委托公证书',
                6 => '评估报告',
                7 => '收入证明',
            ),
        );
        return $config;
    }
}


/* End of file bargain_config_model.php */
/* Location: ./application/models/bargain_config_model.php */
