<?php if (!defined('BASEPATH')) exit('No direct script access allowed');
header("Content-type:text/html;charset=utf-8");

class disimport extends MY_Controller
{

  /**
   * 解析函数
   *
   * @access public
   * @return void
   */
  public function __construct()
  {
    parent::__construct();

    $submit_flag = $this->input->get_post('submit_flag');

    //================ 判断登录 ================//
    if ($submit_flag != 'logout') {
      if (isset($_SESSION[WEB_AUTH]["uid"]) && $_SESSION[WEB_AUTH]["uid"] > 0) {
        header("Location: " . FRAME_INDEX);
        exit;
      }
    }

    //$this->load->helper('user_helper');
    $this->load->model('disimport_model');
  }

  /**
   * 导入
   */
  public function index()
  {
    $shfangxq = array(
      "浦东" => array(
        '北蔡',
        '碧云',
        '川沙',
        '曹路',
        '高行',
        '航头',
        '惠南',
        '花木',
        '金桥',
        '金杨',
        '康桥',
        '联洋',
        '临港新城',
        '陆家嘴',
        '南码头',
        '三林',
        '世博',
        '世纪公园',
        '塘桥',
        '唐镇',
        '外高桥',
        '潍坊',
        '新场',
        '杨东',
        '洋泾',
        '源深',
        '张江',
        '周浦',
        '祝桥'
      ),
      "闵行" => array(
        '春申',
        '古美',
        '航华',
        '华漕',
        '金虹桥',
        '金汇',
        '静安新城',
        '老闵行',
        '龙柏',
        '罗阳',
        '马桥',
        '梅陇',
        '浦江',
        '七宝',
        '吴泾',
        '莘庄',
        '颛桥'
      ),
      "徐汇" => array(
        '漕河泾',
        '长桥',
        '衡山路',
        '华东理工',
        '华泾',
        '建国西路',
        '康健',
        '龙华',
        '上海南站',
        '田林',
        '万体馆',
        '斜土路',
        '徐汇滨江',
        '徐家汇',
        '植物园'
      ),
      "宝山" => array(
        '大场镇',
        '大华',
        '高境',
        '共富',
        '共康',
        '顾村',
        '罗店',
        '罗泾',
        '上大',
        '淞宝',
        '淞南',
        '通河',
        '杨行',
        '月浦',
        '张庙'
      ),
      "普陀" => array(
        '曹杨',
        '长风',
        '长寿路',
        '长征',
        '甘泉宜川',
        '光新',
        '桃浦',
        '万里',
        '武宁',
        '真光',
        '真如',
        '中远两湾城'
      ),
      "长宁" => array(
        '北新泾',
        '古北',
        '虹桥',
        '天山',
        '西郊',
        '仙霞',
        '新华路',
        '镇宁路',
        '中山公园'
      ),
      "杨浦" => array(
        '鞍山',
        '东外滩',
        '黄兴公园',
        '控江路',
        '五角场',
        '新江湾城',
        '杨浦大桥',
        '中原',
        '周家嘴路'
      ),
      "松江" => array(
        '九亭',
        '佘山',
        '泗泾',
        '松江老城',
        '松江新城',
        '莘闵别墅',
        '松江大学城',
        '新桥'
      ),
      "嘉定" => array(
        '安亭',
        '丰庄',
        '嘉定城区',
        '江桥',
        '菊园新区',
        '嘉定新城',
        '马陆',
        '南翔'
      ),
      "虹口" => array(
        '北外滩',
        '江湾镇',
        '凉城',
        '临平路',
        '鲁迅公园',
        '曲阳',
        '四川北路'
      ),
      "闸北" => array(
        '不夜城',
        '大宁',
        '彭浦',
        '西藏北路',
        '阳城',
        '永和',
        '闸北公园'
      ),
      "静安" => array(
        '曹家渡',
        '江宁路',
        '静安寺',
        '南京西路'
      ),
      "黄埔" => array(
        '董家渡',
        '黄浦滨江',
        '老西门',
        '南京东路',
        '蓬莱公园',
        '人民广场',
        '豫园'
      ),
      "卢湾" => array(
        '打浦桥',
        '淮海中路',
        '世博滨江',
        '五里桥',
        '新天地'
      ),
      "青浦" => array(
        '白鹤',
        '华新',
        '青浦城区',
        '徐泾',
        '重固',
        '朱家角',
        '赵巷'
      ),
      "奉贤" => array(
        '奉城',
        '奉贤其它',
        '海湾',
        '海湾旅游区',
        '金汇镇',
        '南桥',
        '西渡',
        '柘林',
        '庄行'
      ),
      "金山" => array(
        '枫泾',
        '金山其它',
        '金山新城',
        '石化',
        '亭林',
        '朱泾'
      ),
      "崇明" => array(
        '崇明'
      ),
      "上海周边" => array(
        '嘉兴',
        '昆山',
        '其它',
        '苏州'
      )
    );
    $result = $this->disimport_model->import($shfangxq);
  }
}

/* End of file login.php */
/* Location: ./application/controllers/login.php */
